# List Comprehension

List comprehension is on e of the methods of creating a list.
List comprehension makes your code redable.

will divide list comprehension into 3 parts for better understanding.

    1. Simple List comprehension
    2. intermediate list comprehension
    3. Advanced list comprehension

### Simple List Comprehension

 Syntax of simple list comprehension

    [ expression for item in iterable] where:
        * expression is the computation you want to do
        * For is our normal for loop
        * item is the object in the expression like x or y
        * iterable is a list, set or any data structure that can return its element one at a time

In [2]:
# Example 1 

[x for x in 'python']

# itr creates a new list for the string

['p', 'y', 't', 'h', 'o', 'n']

In [3]:
# Example 2 

[x for x in range(1,20)] # Creating a list from a range

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19]

In [5]:
# example 3 

item = ['Math', 'science', 'geography', 'history']

[x.upper() for x in item]

# here x.upper() is the expression that we want

['MATH', 'SCIENCE', 'GEOGRAPHY', 'HISTORY']

In [7]:
# Example 4

a =[1,2,3,4,5,6,7,8,9]

[x*2 for x in a] # Creating the list multiplying the item

[2, 4, 6, 8, 10, 12, 14, 16, 18]

In [9]:
# Example 5 

a = [1,2,3,4,5]
b = [6,7,8,9,10]

c = [a[i] * b[i] for i in range(0,len(a))]

print(c)

[6, 14, 24, 36, 50]

## Intermediate List Comprehension

### Intermediate list comprehension comes with a conditional statement.

Syntax of List comprehension:
    
#### (1) [exression for item in iterable if conditional statement ] - This is used when you intend on using only if conditional statement


    [expression if condition else condition for item in iterable]-- This is used when you intend on using the if and else statement
     where:
        1. Expression is the computation you want to do , e.g x+y
        2. For is for normal for loop
        3. item is the object in the expression
        4. ie/else are conditional statement
        5. iterable is a list, set or any data structure that can  return its element one at a time

In [11]:
# Example 1

list1 = [1,2,3,4,'a','hello','python',5,6]

list2 = ['b','a','c',5,2,'simple']

# using for loop 

new_list = []
for x in list1:
    for y in list2:
        if x==y:
            new_list.append(x)
            
print(new_list)

[2, 'a', 5]

In [12]:
# same operation with list comprehension

new_list = [x for x in list1 for y in list2 if x==y]
print(new_list)

[2, 'a', 5]

In [13]:
# Example 2 - to find the even number

even =[]

for x in range(1,50):
    if x%2 ==0:
        even.append(x)
        
print(even)

[2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48]

In [15]:
# same operation with list comprehension 

even = [x for x in range(1,50) if x%2 ==0]
print(even)

[2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48]

In [17]:
# Example 3

# create a new list within range 1-100, if they are divisible by 2 and 7

new_list = [x for x in range(1,100) if x%2 ==0 if x%7 ==0]
new_list

[14, 28, 42, 56, 70, 84, 98]

### Using 2 conditions in list comprehension

In [19]:
list1 = [1,2,4,5,7,8,19,28,30,66,100,120]

['even' if x%2 ==0 else 'odd' for x in list1]

['odd',
 'even',
 'even',
 'odd',
 'odd',
 'even',
 'odd',
 'even',
 'even',
 'even',
 'even',
 'even']

In [20]:
# Nested List comprehension with an if condition

# Creating a new list from a nested list if length of values is lesser than 5

years = [['January', 'February', 'March'], ['April', 'May', 'June'], ['July', 'August', 'September'],['October','November','December']]

[years for sublist in years for years in sublist if len(years) <=5]

['March', 'April', 'May', 'June', 'July']

In [21]:
# Create a list that will add 1 to every value greater than 5 between a range 0f 1-20 and substract 1 for every value lesser than 5 


[x+1 if x>5 else x-1 for x in range(1,20)]

[0, 1, 2, 3, 4, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]

# Advanced List Comprehension

In [23]:
# Example 1
# Create a disctionary

{str(a):a for a in [1,2,3,4,5]}

{'1': 1, '2': 2, '3': 3, '4': 4, '5': 5}

In [25]:
# Example 2

a = ['subject', 'Food','Fruit', 'Movie']
b = ['Mathematics','pasta','banana', 'Titanic']

{x:y for x in a for y in b}

{'subject': 'Titanic',
 'Food': 'Titanic',
 'Fruit': 'Titanic',
 'Movie': 'Titanic'}

In [27]:
subjects = ['Math','science','physics','Chemistry','Geology']

sub_dict = {x:y for y,x in enumerate(subjects)}
sub_dict

{'Math': 0, 'science': 1, 'physics': 2, 'Chemistry': 3, 'Geology': 4}

In [29]:
{y:x for x,y in sub_dict.items()}

{0: 'Math', 1: 'science', 2: 'physics', 3: 'Chemistry', 4: 'Geology'}

# Using List comprehension with a Function

In [30]:
def func(x):
    return x**2

In [31]:
# Using above function 

[func(x) for x in [1,2,3,4,5]]

[1, 4, 9, 16, 25]

# Using List comprehension on dataFrame

In [32]:
import pandas as pd
import numpy as np

In [41]:
a={"Name":["Mary","Ada","Jonathan","Adrian"],
  "age":[25,20,37,50],
   "Occupation":["Doctor","Data Scientist",np.nan,"Soldier"],
   "Gender":["female",np.nan,np.nan,np.nan]
  }

In [42]:
# Creating a dataframe

data = pd.DataFrame(a)
data

       Name  age      Occupation  Gender
0      Mary   25          Doctor  female
1       Ada   20  Data Scientist     NaN
2  Jonathan   37             NaN     NaN
3    Adrian   50         Soldier     NaN

In [43]:
# capitalize the Names

data['Name'] = [i.upper() for i in data['Name']]
data

       Name  age      Occupation  Gender
0      MARY   25          Doctor  female
1       ADA   20  Data Scientist     NaN
2  JONATHAN   37             NaN     NaN
3    ADRIAN   50         Soldier     NaN

In [44]:
# adding 10 to the Age

data['age'] = [i+10 for i in data['age']]
data

       Name  age      Occupation  Gender
0      MARY   35          Doctor  female
1       ADA   30  Data Scientist     NaN
2  JONATHAN   47             NaN     NaN
3    ADRIAN   60         Soldier     NaN

In [45]:
# find out the columns having na value more than 1

[column for column in data.columns if data[column].isna().sum() >=1]

['Occupation', 'Gender']

In [49]:
# Creating a new column with condition 

data['Total-age'] = [i if i<40 else i//3 for i in data['age']]

In [50]:
data

       Name  age      Occupation  Gender  Total-age
0      MARY   35          Doctor  female         35
1       ADA   30  Data Scientist     NaN         30
2  JONATHAN   47             NaN     NaN         15
3    ADRIAN   60         Soldier     NaN         20